In [18]:
import pandas as pd
import numpy as np
import seaborn as sns

import matplotlib.pyplot as plt

import plotly.graph_objects as go

import plotly.figure_factory as ff

from datetime import datetime

In [19]:
import json

In [20]:
with open(r'C:\Users\ASUS\Desktop\CAPSTONE PROJECT\Group2 capstone\behaviour.json') as file:
    data = json.load(file)

In [21]:
data_list = []

for item in data:
    for key, value in item.items():
        # Extract the numeric part of the key (e.g., "1826" from "ID_1826")
        id_num = key[3:]
        new_item = {
            'ID': id_num,
            'Recency': value['Recency'],
            'MntWines': value['MntWines'],
            'MntFruits': value['MntFruits'],
            'MntMeatProducts': value['MntMeatProducts'],
            'MntFishProducts': value['MntFishProducts'],
            'MntSweetProducts': value['MntSweetProducts'],
            'MntGoldProds': value['MntGoldProds']
        }
        
         # Append the new dictionary to the data list
        data_list.append(new_item)

In [26]:
# Create a new DataFrame from the data list for behaviour
df = pd.DataFrame(data_list)
df

,ID,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
0,1826,0,189,104,379,111,189,218
1,1,0,464,5,64,7,0,37
2,10476,0,134,11,59,15,2,30
3,1386,0,10,0,1,0,0,0
4,5371,0,6,16,24,11,0,34
...,...,...,...,...,...,...,...,...
2235,10142,99,372,18,126,47,48,78
2236,5263,99,5,10,13,3,8,16
2237,22,99,185,2,88,15,5,14
2238,528,99,267,38,701,149,165,63
2239,4070,99,169,24,553,188,0,144

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2240 non-null   int64
 1   Year_Birth      2240 non-null   int64
 2   Education       2240 non-null   object
 3   Marital_Status  2240 non-null   object
 4    Income         2216 non-null   object
 5   Kidhome         2240 non-null   int64
 6   Teenhome        2240 non-null   int64
 7   Dt_Customer     2240 non-null   object
 8   Country         2240 non-null   object
dtypes: int64(4), object(5)
memory usage: 157.6+ KB

In [52]:
with open(r'C:\Users\ASUS\Desktop\CAPSTONE PROJECT\Group2 capstone\campaign.json') as file:
    data1 = json.load(file)
    
    data_list1 = []

for item in data1:
    for key, value in item.items():
        # Extract the numeric part of the key (e.g., "1826" from "ID_1826")
        id_num = key[3:]
        new_item1 = {
            'ID': id_num,
            'AcceptedCmp1': value['AcceptedCmp1'],
            'AcceptedCmp2': value['AcceptedCmp2'],
            'AcceptedCmp3': value['AcceptedCmp3'],
            'AcceptedCmp4': value['AcceptedCmp4'],
            'AcceptedCmp5': value['AcceptedCmp5'],
            'Response': value['Response'],
            'Complain': value['Complain']
        }
        
         # Append the new dictionary to the data list
        data_list1.append(new_item1)

In [53]:
# Create a new DataFrame from the data list for behaviour
df2 = pd.DataFrame(data_list1)
df2

,ID,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,0,0,0,0,0,1,0
1,1,0,1,0,0,0,1,0
2,10476,0,0,0,0,0,0,0
3,1386,0,0,0,0,0,0,0
4,5371,0,0,1,0,0,1,0
...,...,...,...,...,...,...,...,...
2235,10142,0,0,0,0,0,0,0
2236,5263,0,0,0,0,0,0,0
2237,22,0,0,0,0,0,0,0
2238,528,0,0,0,0,0,0,0
2239,4070,0,0,0,1,1,1,0

In [54]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            2240 non-null   object
 1   AcceptedCmp1  2240 non-null   int64
 2   AcceptedCmp2  2240 non-null   int64
 3   AcceptedCmp3  2240 non-null   int64
 4   AcceptedCmp4  2240 non-null   int64
 5   AcceptedCmp5  2240 non-null   int64
 6   Response      2240 non-null   int64
 7   Complain      2240 non-null   int64
dtypes: int64(7), object(1)
memory usage: 140.1+ KB

In [37]:
df3 =pd.read_csv(r'C:\Users\ASUS\Desktop\CAPSTONE PROJECT\Group2 capstone\demographics.txt', sep='\t')
df3

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP
...,...,...,...,...,...,...,...,...,...
2235,10142,1976,PhD,Divorced,"$66,476.00",0,1,3/7/13,US
2236,5263,1977,2n Cycle,Married,"$31,056.00",1,0,1/22/13,SP
2237,22,1976,Graduation,Divorced,"$46,310.00",1,0,12/3/12,SP
2238,528,1978,Graduation,Married,"$65,819.00",0,0,11/29/12,IND
2239,4070,1969,PhD,Married,"$94,871.00",0,2,9/1/12,CA

In [40]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2240 non-null   int64
 1   Year_Birth      2240 non-null   int64
 2   Education       2240 non-null   object
 3   Marital_Status  2240 non-null   object
 4    Income         2216 non-null   object
 5   Kidhome         2240 non-null   int64
 6   Teenhome        2240 non-null   int64
 7   Dt_Customer     2240 non-null   object
 8   Country         2240 non-null   object
dtypes: int64(4), object(5)
memory usage: 157.6+ KB

In [43]:
df['ID'] = df['ID'].astype(str)
df2['ID'] = df2['ID'].astype(str)
df3['ID'] = df3['ID'].astype(str)

In [55]:
# Merging the DataFrames vertically .
df_data = pd.merge(df, df2, on='ID')
df_data

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP,0,0,0,0,0,1,0
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA,0,1,0,0,0,1,0
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US,0,0,0,0,0,0,0
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS,0,0,0,0,0,0,0
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP,0,0,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10142,1976,PhD,Divorced,"$66,476.00",0,1,3/7/13,US,0,0,0,0,0,0,0
2236,5263,1977,2n Cycle,Married,"$31,056.00",1,0,1/22/13,SP,0,0,0,0,0,0,0
2237,22,1976,Graduation,Divorced,"$46,310.00",1,0,12/3/12,SP,0,0,0,0,0,0,0
2238,528,1978,Graduation,Married,"$65,819.00",0,0,11/29/12,IND,0,0,0,0,0,0,0
2239,4070,1969,PhD,Married,"$94,871.00",0,2,9/1/12,CA,0,0,0,1,1,1,0

In [60]:
df_data.shape

(2240, 16)

In [58]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2240 non-null   object
 1   Year_Birth      2240 non-null   int64
 2   Education       2240 non-null   object
 3   Marital_Status  2240 non-null   object
 4    Income         2216 non-null   object
 5   Kidhome         2240 non-null   int64
 6   Teenhome        2240 non-null   int64
 7   Dt_Customer     2240 non-null   object
 8   Country         2240 non-null   object
 9   AcceptedCmp1    2240 non-null   int64
 10  AcceptedCmp2    2240 non-null   int64
 11  AcceptedCmp3    2240 non-null   int64
 12  AcceptedCmp4    2240 non-null   int64
 13  AcceptedCmp5    2240 non-null   int64
 14  Response        2240 non-null   int64
 15  Complain        2240 non-null   int64
dtypes: int64(10), object(6)
memory usage: 297.5+ KB

In [64]:
df_data.rename(columns ={" Income ":"Income"},inplace=True)
df_data

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP,0,0,0,0,0,1,0
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA,0,1,0,0,0,1,0
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US,0,0,0,0,0,0,0
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS,0,0,0,0,0,0,0
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP,0,0,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10142,1976,PhD,Divorced,"$66,476.00",0,1,3/7/13,US,0,0,0,0,0,0,0
2236,5263,1977,2n Cycle,Married,"$31,056.00",1,0,1/22/13,SP,0,0,0,0,0,0,0
2237,22,1976,Graduation,Divorced,"$46,310.00",1,0,12/3/12,SP,0,0,0,0,0,0,0
2238,528,1978,Graduation,Married,"$65,819.00",0,0,11/29/12,IND,0,0,0,0,0,0,0
2239,4070,1969,PhD,Married,"$94,871.00",0,2,9/1/12,CA,0,0,0,1,1,1,0

In [68]:
df_data['Income'] = df_data['Income'].str.replace('$', '').str.replace(',', '')
df_data

C:\Users\ASUS\AppData\Local\Temp\ipykernel_11880\348680388.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_data['Income'] = df_data['Income'].str.replace('$', '').str.replace(',', '')

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,1970,Graduation,Divorced,84835.00,0,0,6/16/14,SP,0,0,0,0,0,1,0
1,1,1961,Graduation,Single,57091.00,0,0,6/15/14,CA,0,1,0,0,0,1,0
2,10476,1958,Graduation,Married,67267.00,0,1,5/13/14,US,0,0,0,0,0,0,0
3,1386,1967,Graduation,Together,32474.00,1,1,5/11/14,AUS,0,0,0,0,0,0,0
4,5371,1989,Graduation,Single,21474.00,1,0,4/8/14,SP,0,0,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10142,1976,PhD,Divorced,66476.00,0,1,3/7/13,US,0,0,0,0,0,0,0
2236,5263,1977,2n Cycle,Married,31056.00,1,0,1/22/13,SP,0,0,0,0,0,0,0
2237,22,1976,Graduation,Divorced,46310.00,1,0,12/3/12,SP,0,0,0,0,0,0,0
2238,528,1978,Graduation,Married,65819.00,0,0,11/29/12,IND,0,0,0,0,0,0,0
2239,4070,1969,PhD,Married,94871.00,0,2,9/1/12,CA,0,0,0,1,1,1,0

In [71]:
df_data['Income'] = df_data['Income'].astype(float)
df_data['Kidhome'] = df_data['Kidhome'].astype(str)
df_data['Teenhome'] = df_data['Teenhome'].astype(str)
df_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2240 non-null   object
 1   Year_Birth      2240 non-null   int64
 2   Education       2240 non-null   object
 3   Marital_Status  2240 non-null   object
 4   Income          2216 non-null   float64
 5   Kidhome         2240 non-null   object
 6   Teenhome        2240 non-null   object
 7   Dt_Customer     2240 non-null   object
 8   Country         2240 non-null   object
 9   AcceptedCmp1    2240 non-null   int64
 10  AcceptedCmp2    2240 non-null   int64
 11  AcceptedCmp3    2240 non-null   int64
 12  AcceptedCmp4    2240 non-null   int64
 13  AcceptedCmp5    2240 non-null   int64
 14  Response        2240 non-null   int64
 15  Complain        2240 non-null   int64
dtypes: float64(1), int64(8), object(7)
memory usage: 297.5+ KB